In [82]:
# most common packages

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb
import re
from pprint import pprint
sb.set()

In [83]:
# How to create series?
nums = [1, 2, 3, 4, 5]
s = pd.Series(nums, index = ['aaa', 'bbb', 'ccc', 'ddd','eee'] )
print(type(s))
s

<class 'pandas.core.series.Series'>

aaa    1
bbb    2
ccc    3
ddd    4
eee    5
dtype: int64

In [84]:
s.index

Index(['aaa', 'bbb', 'ccc', 'ddd', 'eee'], dtype='object')

In [85]:
s.values

array([1, 2, 3, 4, 5], dtype=int64)

In [86]:
s['eee']

5

In [87]:
s.eee

5

In [88]:
fruits = ['Orange','Banana','Mango']
fruits = pd.Series(fruits, index=['O', 'B', 'M'])
print(fruits)

O    Orange
B    Banana
M     Mango
dtype: object

In [89]:
dct = {
    'name':'Asabeneh',
    'country':'Finland',
    'city':'Helsinki'
}
s = pd.Series(dct)
print(s)

name       Asabeneh
country     Finland
city       Helsinki
dtype: object

In [90]:
s.index

Index(['name', 'country', 'city'], dtype='object')

In [91]:
s.values

array(['Asabeneh', 'Finland', 'Helsinki'], dtype=object)

In [92]:
s = pd.Series(100, index = [1, 2, 3])
print(s)

1    100
2    100
3    100
dtype: int64

In [93]:
data = [
    ['Asabeneh', 'Finland', 'Helsink'], 
    ['David', 'UK', 'London'],
    ['John', 'Sweden', 'Stockholm']
]
df = pd.DataFrame(data, columns=['Names','Country','City'])
df

      Names  Country       City
0  Asabeneh  Finland    Helsink
1     David       UK     London
2      John   Sweden  Stockholm

In [94]:
df['weight'] = [75, 78, 85]
df['height'] = [1.73, 1.9, 1.88]

In [95]:
df

      Names  Country       City  weight  height
0  Asabeneh  Finland    Helsink      75    1.73
1     David       UK     London      78    1.90
2      John   Sweden  Stockholm      85    1.88

In [96]:
data = [
    {'Name': 'Asabeneh', 'Country': 'Finland', 'City': 'Helsinki'},
    {'Name': 'David', 'Country': 'UK', 'City': 'London'},
    {'Name': 'John', 'Country': 'Sweden', 'City': 'Stockholm'}]
df = pd.DataFrame(data)
df

       Name  Country       City
0  Asabeneh  Finland   Helsinki
1     David       UK     London
2      John   Sweden  Stockholm

In [97]:
# data loading
df = pd.read_csv('../data/weight-height.csv')
df.shape

(10000, 3)

In [98]:
df.columns

Index(['Gender', 'Height', 'Weight'], dtype='object')

In [99]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [100]:
df.head(10)

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801
5   Male  67.253016  152.212156
6   Male  68.785081  183.927889
7   Male  68.348516  167.971110
8   Male  67.018950  175.929440
9   Male  63.456494  156.399676

In [101]:
df.tail()

      Gender     Height      Weight
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

In [102]:
df.tail(10)

      Gender     Height      Weight
9990  Female  63.179498  141.266100
9991  Female  62.636675  102.853563
9992  Female  62.077832  138.691680
9993  Female  60.030434   97.687432
9994  Female  59.098250  110.529686
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

In [103]:
df.shape

(10000, 3)

In [104]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Gender  10000 non-null  object
 1   Height  10000 non-null  float64
 2   Weight  10000 non-null  float64
dtypes: float64(2), object(1)
memory usage: 234.5+ KB

In [105]:
df.describe()

             Height        Weight
count  10000.000000  10000.000000
mean      66.367560    161.440357
std        3.847528     32.108439
min       54.263133     64.700127
25%       63.505620    135.818051
50%       66.318070    161.212928
75%       69.174262    187.169525
max       78.998742    269.989699

In [106]:
df.head()

  Gender     Height      Weight
0   Male  73.847017  241.893563
1   Male  68.781904  162.310473
2   Male  74.110105  212.740856
3   Male  71.730978  220.042470
4   Male  69.881796  206.349801

In [107]:
males_df = df[df['Gender'] == 'Male']
females_df = df[df['Gender'] == 'Female']

In [108]:
males_df.to_csv('males.csv', index = False, encoding='utf-8')
females_df.to_csv('females.csv', index = False, encoding='utf-8')

In [109]:
males_df.describe()

            Height       Weight
count  5000.000000  5000.000000
mean     69.026346   187.020621
std       2.863362    19.781155
min      58.406905   112.902939
25%      67.174679   173.887767
50%      69.027709   187.033546
75%      70.988744   200.357802
max      78.998742   269.989699

In [110]:
females_df.describe()

            Height       Weight
count  5000.000000  5000.000000
mean     63.708774   135.860093
std       2.696284    19.022468
min      54.263133    64.700127
25%      61.894441   122.934096
50%      63.730924   136.117583
75%      65.563565   148.810926
max      73.389586   202.237214

In [111]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [112]:
# data loading
df = pd.read_csv('../data/weight-height.csv')
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [113]:
df.groupby(['Gender']).mean()

           Height      Weight
Gender
Female  63.708774  135.860093
Male    69.026346  187.020621

In [114]:
df.corr

<bound method DataFrame.corr of       Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]>

In [117]:
df[['Weight', 'Height']].corr()

          Weight    Height
Weight  1.000000  0.924756
Height  0.924756  1.000000

In [118]:
df

      Gender     Height      Weight
0       Male  73.847017  241.893563
1       Male  68.781904  162.310473
2       Male  74.110105  212.740856
3       Male  71.730978  220.042470
4       Male  69.881796  206.349801
...      ...        ...         ...
9995  Female  66.172652  136.777454
9996  Female  67.067155  170.867906
9997  Female  63.867992  128.475319
9998  Female  69.034243  163.852461
9999  Female  61.944246  113.649103

[10000 rows x 3 columns]

In [120]:
df.corr(numeric_only=True)

          Height    Weight
Height  1.000000  0.924756
Weight  0.924756  1.000000

In [123]:
dataplot = sb.heatmap(data.corr(numeric_only=True), cmap="YlGnBu", annot=True)

# Displaying heatmap
plt.show()

AttributeError: 'list' object has no attribute 'corr'